# dataframe-2d labelled datastructure which resembles table

In [1]:
import pandas as pd

In [4]:
d={'1':['a','b','c'],
'2':['e','f','g']}

In [5]:
df=pd.DataFrame(d)

In [6]:
print(df)

   1  2
0  a  e
1  b  f
2  c  g

# series-single dimensional labelled array

In [7]:
l=[1,2,3,4]

In [8]:
se=pd.Series(l)

In [10]:
print(se)

0    1
1    2
2    3
3    4
dtype: int64

In [12]:
print(type(se))

<class 'pandas.core.series.Series'>

In [13]:
d1={1:[1,2,3],2:[4,5,6]}

In [17]:
df1=pd.DataFrame(d1,index=['a','b','c'])

In [18]:
print(df1)

   1  2
a  1  4
b  2  5
c  3  6

In [19]:
d={'1':['a','b','c'],
'2':['e','f','g']}

In [20]:
df2=pd.DataFrame(d)

In [21]:
print(df2)

   1  2
0  a  e
1  b  f
2  c  g

In [24]:
print(df2.loc[1][1])

f

C:\Users\cheta\AppData\Local\Temp\ipykernel_23580\545985298.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df2.loc[1][1])

# loc -label based indexing

# iloc - position based indexing

In [26]:
df=pd.DataFrame({'a':[1,2,3],'b':[4,5,6]})

In [28]:
print(df)

   a  b
0  1  4
1  2  5
2  3  6

In [33]:
print(df.loc[0]['a'])

1

In [57]:
df1=pd.DataFrame({'a':[1,2],'b':[3,4]},index=['a','b'])

In [58]:
print(df1)

   a  b
a  1  3
b  2  4

In [59]:
print(df1.iloc[0][1])

3

C:\Users\cheta\AppData\Local\Temp\ipykernel_23580\2786324782.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(df1.iloc[0][1])

In [60]:
print(df1.loc['a']['a'])

1

In [77]:
df=pd.read_csv(r"C:\Users\cheta\Desktop\machine-readable-business-employment-data-jun-2025-quarter.csv")

In [78]:
print(df)

      Series_reference   Period  Data_value Suppressed STATUS   UNITS  \
0          BDCQ.SEA1AA  2011.06     80078.0        NaN      F  Number
1          BDCQ.SEA1AA  2011.09     78324.0        NaN      F  Number
2          BDCQ.SEA1AA  2011.12     85850.0        NaN      F  Number
3          BDCQ.SEA1AA  2012.03     90743.0        NaN      F  Number
4          BDCQ.SEA1AA  2012.06     81780.0        NaN      F  Number
...                ...      ...         ...        ...    ...     ...
24893    BDCQ.SEE3999A  2017.06         NaN          Y      F  Number
24894    BDCQ.SEE3999A  2017.09         NaN          Y      F  Number
24895    BDCQ.SEE3999A  2017.12         NaN          Y      F  Number
24896    BDCQ.SEE3999A  2018.03         NaN          Y      F  Number
24897    BDCQ.SEE3999A  2018.06         NaN          Y      F  Number

       Magnitude                         Subject  \
0              0  Business Data Collection - BDC
1              0  Business Data Collection - BDC
2              0  Business Data Collection - BDC
3              0  Business Data Collection - BDC
4              0  Business Data Collection - BDC
...          ...                             ...
24893          0  Business Data Collection - BDC
24894          0  Business Data Collection - BDC
24895          0  Business Data Collection - BDC
24896          0  Business Data Collection - BDC
24897          0  Business Data Collection - BDC

                                              Group  \
0                   Industry by employment variable
1                   Industry by employment variable
2                   Industry by employment variable
3                   Industry by employment variable
4                   Industry by employment variable
...                                             ...
24893  Territorial authority by employment variable
24894  Territorial authority by employment variable
24895  Territorial authority by employment variable
24896  Territorial authority by employment variable
24897  Territorial authority by employment variable

                               Series_title_1  \
0                                 Filled jobs
1                                 Filled jobs
2                                 Filled jobs
3                                 Filled jobs
4                                 Filled jobs
...                                       ...
24893  Filled jobs (workplace location based)
24894  Filled jobs (workplace location based)
24895  Filled jobs (workplace location based)
24896  Filled jobs (workplace location based)
24897  Filled jobs (workplace location based)

                           Series_title_2 Series_title_3  Series_title_4  \
0       Agriculture, Forestry and Fishing         Actual             NaN
1       Agriculture, Forestry and Fishing         Actual             NaN
2       Agriculture, Forestry and Fishing         Actual             NaN
3       Agriculture, Forestry and Fishing         Actual             NaN
4       Agriculture, Forestry and Fishing         Actual             NaN
...                                   ...            ...             ...
24893  Area Outside Territorial Authority         Actual             NaN
24894  Area Outside Territorial Authority         Actual             NaN
24895  Area Outside Territorial Authority         Actual             NaN
24896  Area Outside Territorial Authority         Actual             NaN
24897  Area Outside Territorial Authority         Actual             NaN

       Series_title_5
0                 NaN
1                 NaN
2                 NaN
3                 NaN
4                 NaN
...               ...
24893             NaN
24894             NaN
24895             NaN
24896             NaN
24897             NaN

[24898 rows x 14 columns]

In [45]:
df1=pd.DataFrame({'a':['charan','ravi'],2:['rajesh','ramu']})

In [46]:
print(df1)

        a       2
0  charan  rajesh
1    ravi    ramu

In [48]:
df1.to_csv('output.csv')

In [49]:
df1.to_csv('output1.csv',index=False)

In [52]:
df.head()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,BDCQ.SEA1AA,2011.06,80078.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
1,BDCQ.SEA1AA,2011.09,78324.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
2,BDCQ.SEA1AA,2011.12,85850.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
3,BDCQ.SEA1AA,2012.03,90743.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN
4,BDCQ.SEA1AA,2012.06,81780.0,NaN,F,Number,0,Business Data Collection - BDC,Industry by employment variable,Filled jobs,"Agriculture, Forestry and Fishing",Actual,NaN,NaN

In [53]:
df.tail()

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
24893,BDCQ.SEE3999A,2017.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24894,BDCQ.SEE3999A,2017.09,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24895,BDCQ.SEE3999A,2017.12,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24896,BDCQ.SEE3999A,2018.03,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN
24897,BDCQ.SEE3999A,2018.06,NaN,Y,F,Number,0,Business Data Collection - BDC,Territorial authority by employment variable,Filled jobs (workplace location based),Area Outside Territorial Authority,Actual,NaN,NaN

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 24898 entries, 0 to 24897
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Series_reference  24898 non-null  object
 1   Period            24898 non-null  float64
 2   Data_value        22059 non-null  float64
 3   Suppressed        2839 non-null   object
 4   STATUS            24898 non-null  object
 5   UNITS             24898 non-null  object
 6   Magnitude         24898 non-null  int64
 7   Subject           24898 non-null  object
 8   Group             24898 non-null  object
 9   Series_title_1    24898 non-null  object
 10  Series_title_2    24898 non-null  object
 11  Series_title_3    24898 non-null  object
 12  Series_title_4    0 non-null      float64
 13  Series_title_5    0 non-null      float64
dtypes: float64(4), int64(1), object(9)
memory usage: 2.7+ MB

In [61]:
df1.shape

(2, 2)

In [62]:
df.describe()

,Period,Data_value,Magnitude,Series_title_4,Series_title_5
count,24898.000000,2.205900e+04,24898.000000,0.0,0.0
mean,2017.692457,7.358011e+04,2.270303,NaN,NaN
std,4.063672,2.129798e+05,2.909963,NaN,NaN
min,2011.060000,1.171797e+00,0.000000,NaN,NaN
25%,2014.090000,1.935656e+03,0.000000,NaN,NaN
50%,2018.030000,1.419000e+04,0.000000,NaN,NaN
75%,2021.060000,6.099200e+04,6.000000,NaN,NaN
max,2025.060000,2.321295e+06,6.000000,NaN,NaN

In [63]:
df.dtypes

Series_reference     object
Period              float64
Data_value          float64
Suppressed           object
STATUS               object
UNITS                object
Magnitude             int64
Subject              object
Group                object
Series_title_1       object
Series_title_2       object
Series_title_3       object
Series_title_4      float64
Series_title_5      float64
dtype: object

# handling null values

In [80]:
df=pd.DataFrame({1:[1,2,pd.NA],2:[2,None,6]})

In [69]:
print(df)

      1    2
0     1  2.0
1     2  NaN
2  <NA>  6.0

In [67]:
df.dropna()

   1    2
0  1  2.0

In [71]:
x=df.fillna(0)

C:\Users\cheta\AppData\Local\Temp\ipykernel_23580\1141373660.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  x=df.fillna(0)

In [72]:
print(x)

   1    2
0  1  2.0
1  2  0.0
2  0  6.0

In [73]:
print(df)

      1    2
0     1  2.0
1     2  NaN
2  <NA>  6.0

In [81]:
df.fillna(0,inplace=True)

C:\Users\cheta\AppData\Local\Temp\ipykernel_23580\1840858203.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(0,inplace=True)

In [75]:
print(df)

   1    2
0  1  2.0
1  2  0.0
2  0  6.0

In [82]:
df.corr()

          1         2
1  1.000000 -0.981981
2 -0.981981  1.000000

In [83]:
import numpy as np

In [86]:
df={1:[1,2,np.nan]}

In [87]:
df=pd.DataFrame(df)

In [88]:
print(df)

     1
0  1.0
1  2.0
2  NaN

In [89]:
df.dropna()

     1
0  1.0
1  2.0